app/views/shared/_doctor_review_form_body.html.haml

SELECT `countries`.* FROM `countries`   ORDER BY name asc
---
              - selected = ft.object.country_id.nil? ? current_user.country_id : ft.object.country_id
              = ft.select :country_id, options_for_select([['Please Select', '']] + Country.order('name asc').map{|c| [c.name, c.id]}, selected), {}, class: 'form-control select2'