app/helpers/application_helper.rb

SELECT  `photos`.* FROM `photos`  WHERE `photos`.`type` IN ('CroppedPhoto') AND `photos`.`id` = 24 LIMIT 1
---
  def user_avatar_url(user, style = :original, options = nil)
    options ||= {}
    if user.profile_photo.present? && !options[:anonymous]