app/helpers/posts_helper.rb

SELECT `conditions`.* FROM `conditions`  WHERE `conditions`.`active` = 1 AND (name is not null and name != '')  ORDER BY name asc
---
  def conditions_options_for_post(condition = nil)
    condition_id = condition.respond_to?(:id) ? condition.id : condition
    options = []
    options << ['My Conditions', 'my_conditions'] if current_user
    options_for_select(options + Condition.active.where("name is not null and name != ?", "").order('name asc').map{|c| [c.name, c.id]}, condition_id)

SELECT `post_categories`.* FROM `post_categories`  WHERE `post_categories`.`name` IN ('Medical', 'Introductions', 'Fun Stuff', 'Social Support')  ORDER BY name ASC
SELECT `post_categories`.* FROM `post_categories`  WHERE `post_categories`.`name` IN ('FAQ', 'Blog')
---
  def post_categories_options
    categories = []
    categories += PostCategory.where(name: ['Medical', 'Introductions', 'Fun Stuff', 'Social Support']).order('name ASC').map{|c| [c.name, c.id]}
    if current_user && current_user.is_admin?
      categories += PostCategory.where(name: %w(FAQ Blog)).map{|c| [c.name, c.id]}