app/helpers/views_helper.rb

  def add_noindex?
    NoindexRule.all.map(&:url).each do |rule|
---
SELECT `noindex_rules`.* FROM `noindex_rules`