app/views/personal_profiles/_user_conditions.html.haml

- current_user.user_conditions.recent.each do |user_condition|
  .well
---
SELECT `user_conditions`.* FROM `user_conditions` WHERE `user_conditions`.`user_id` = 4012 ORDER BY created_at desc