app/views/personal_profiles/_visualize_container.html.haml

SELECT `labs`.* FROM `labs` WHERE `labs`.`user_id` = 4012
SELECT `symptoms`.`symptom` FROM `symptoms` WHERE (symptom <> '' and symptom is not null) AND `symptoms`.`user_id` = 4012
SELECT `treatments`.* FROM `treatments` WHERE (treatment <> '' and treatment is not null) AND `treatments`.`user_id` = 4012
---
    %br/
  - if current_user.symptoms.blank? && current_user.labs.blank? && current_user.treatments.blank?