app/views/personal_profiles/_well_being.html.haml

SELECT  `well_beings`.* FROM `well_beings`  WHERE `well_beings`.`user_id` = 2 LIMIT 1
---

- current_user.build_well_being if current_user.well_being.blank?