app/views/posts/_luv_link.html.haml

- target = post.comment_id.blank? ? post : post.comment
---
SELECT  `comments`.* FROM `comments`  WHERE (comments.deleted = false or comments.deleted is null) AND `comments`.`id` = 52860 LIMIT 1