app/controllers/home_controller.rb

SELECT `conditions`.* FROM `conditions` INNER JOIN `conditions_posts` ON `conditions`.`id` = `conditions_posts`.`condition_id` WHERE `conditions_posts`.`post_id` = 18050 ORDER BY name asc
---
  def new_home
    return redirect_to everything_path(params) if params[:query].present?

    @topics = Post.all.for_feed.order('posts.last_interaction_at desc').group('posts.id')
    @condition_id = 'any' if !current_user && @condition_id == 'my_conditions'
    @topics = @topics.by_conditions(@condition_id, current_user) unless @condition_id == 'any'
    @topics = @topics.by_type('Post')
    unless current_user
      @topics = @topics.joins(:user).where('users.privacy = 1 or users.privacy = 2')

SELECT `users`.* FROM `users` ORDER BY last_sign_in_at DESC LIMIT 16
---
      end
    end

    @active_users = User.last_online.limit(16)

SELECT `conditions`.* FROM `conditions` WHERE `conditions`.`slug` = 'any' ORDER BY name asc LIMIT 1
SELECT  `conditions`.* FROM `conditions`  WHERE `conditions`.`slug` = 'any'  ORDER BY name asc LIMIT 1
---
    conditions = ''
    if @condition_id != 'any'
      return if !current_user && @condition_id == 'my_condiitons'
      conditions = @condition_id == 'my_conditions' ? [current_user.main_condition.try(:id)] + current_user.user_conditions.map(&:condition_id) : [Condition.find_by_slug(@condition_id).try(:id)]
      conditions.compact!
    end
    @condition_id = view_context.get_cached_condition_id == 'my_conditions' ? view_context.get_cached_condition_id : Condition.find_by_slug(view_context.get_cached_condition_id).try(:id)

SELECT *, COUNT(id) as rcount, AVG(numeric_level) as average_level FROM (SELECT treatment_summaries.*, treatments.numeric_level FROM `treatment_summaries`
---
    @condition_id ||= 'any'
    query = "%#{params[:query]}%".downcase
    @summaries = TreatmentSummary.for_summary_page(@condition_id.to_s, params[:sort_by], query)
    @summaries = Kaminari.paginate_array(@summaries).page(params[:page]).per(5)