app/controllers/personal_profiles_controller.rb

  def symptoms_chart
    @user = User.find_by_id(params[:id])
    max_lab_value = @user.labs.find_max_current_value(@user)
    max_lab_value = 1 unless max_lab_value
    @symptoms_chart = LazyHighCharts::HighChart.new('HighStock') do |f|
      if params[:treatments]
        f.yAxis [{
          min: 0,
          max: 10,
          top: 0,
          height: 200,
          lineColor: 'transparent',
          gridLineWidth: 0,
          gridLineColor: 'transparent',
          labels: {enabled: false},
          title: {text: 'Treatments', style: {color: 'transparent'}},
        }, {
          min: 0, max: 10, top: 200, maxPadding: 0.5, height: 200, showLastLabel: true,
            labels: {formatter: 'function() {
                        var labels = {0: "None", 10: "Worst"};
                        label = labels[this.value] ? labels[this.value] : this.value
                        return label;
                      }'.js_code
            }
        }, {min: 0, max: max_lab_value, top: 450, height: 150, showFirstLabel: true, showLastLabel: true, labels: {formatter: 'function(){return this.value;}'.js_code}}]
        f.navigator margin: 100
        f.xAxis top: 130
      else
        f.yAxis min: 0, max: 10
      end
      @user.symptoms.find_each do |symptom|
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 4012 ORDER BY `users`.`id` ASC LIMIT 1
SELECT `labs`.* FROM `labs` WHERE `labs`.`user_id` = 4012
SELECT `symptoms`.* FROM `symptoms` WHERE (symptom <> '' and symptom is not null) AND `symptoms`.`user_id` = 4012 ORDER BY `symptoms`.`id` ASC LIMIT 1000

        f.series series_params
      end
      @user.well_being.tap do |well_being|
        next if well_being.blank?
---
SELECT `well_beings`.* FROM `well_beings` WHERE `well_beings`.`user_id` = 4012 LIMIT 1


      # Treatments
      if params[:treatments]
        @user.treatments.each do |treatment|
---
SELECT `treatments`.* FROM `treatments` WHERE (treatment <> '' and treatment is not null) AND `treatments`.`user_id` = 4012

            y: l.current_value.to_i,
          }
        end
        max_value = lab.lab_logs.not_blank.maximum('current_value')
---
SELECT `lab_logs`.* FROM `lab_logs` WHERE 1=0 ORDER BY current_value DESC LIMIT 1

      if (@user.id == current_user.try(:id) && !params[:time_series].present?) || (current_user.is_admin? && params[:from] == 'time_series_admin')
        data = []
        Event.unscoped do
          @user.events.order('date ASC').each do |event|
---
SELECT `events`.* FROM `events` WHERE `events`.`user_id` = 4012 ORDER BY date ASC

  def basic_info
    if current_user.main_condition_id.present?
---
SELECT `user_conditions`.* FROM `user_conditions` WHERE `user_conditions`.`user_id` = 4012 ORDER BY created_at desc

  def my_health
    @user_condition = UserCondition.new
    @symptom = Symptom.new
    @treatment = Treatment.new
    @remote = true
    @event = Event.new
    @events = current_user.events
    @p = (@events.count / 15.0).ceil
---
SELECT COUNT(*) FROM `events` WHERE `events`.`user_id` = 4012