app/controllers/photos_controller.rb

  def index
    @photos = @user.photos.order("created_at desc").page(params[:page]).per(9)
---
SELECT COUNT(*) FROM `photos` WHERE `photos`.`user_id` = 4012
SELECT `photos`.* FROM `photos` WHERE `photos`.`user_id` = 4012 ORDER BY created_at desc LIMIT 9 OFFSET 0

  def load_user
    @user = User.find(params[:user_id]) if params[:user_id].present?
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 4012 ORDER BY `users`.`id` ASC LIMIT 1