app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 4012 ORDER BY `users`.`id` ASC LIMIT 1
---
  def load_user
    @user = User.find(params[:id]) if params[:id].present?