app/models/condition.rb

  scope :not_user_conditions, ->(user) {active.where('id not in (?)', [user.main_condition_id] + user.conditions.map(&:id))}
---
SELECT `conditions`.* FROM `conditions` INNER JOIN `user_conditions` ON `conditions`.`id` = `user_conditions`.`condition_id` WHERE `user_conditions`.`user_id` = 2  ORDER BY name asc