app/models/meta_tag.rb

  def self.display(params, fullpath)

    if fullpath.include?("conditions")
      m = MetaTag.find_by_url("conditions#index")
    else
      m = MetaTag.find_by_url("#{params[:controller]}##{params[:action]}")
---
SELECT  `meta_tags`.* FROM `meta_tags`  WHERE `meta_tags`.`url` = 'home#new_home' LIMIT 1