app/models/notification.rb

SELECT  `comments`.* FROM `comments`  WHERE (comments.deleted = false or comments.deleted is null) AND `comments`.`id` = 52795 LIMIT 1
SELECT  `posts`.* FROM `posts`  WHERE `posts`.`deleted_at` IS NULL AND (posts.deleted = false OR posts.deleted is null) AND `posts`.`id` = 17805 LIMIT 1
---
  def target_url
    return unless notifiable.present?
    if (notifiable.is_a?(Comment) || notifiable_type == 'Comment') && Comment.find(notifiable_id).commentable.is_a?(Photo)
      "#{Rails.application.routes.url_helpers.user_photo_url(notifiable.commentable.user, notifiable.commentable)}#comment_#{notifiable.id}"
    elsif notifiable.is_a?(Post) || notifiable_type == 'Post'
      if comment.present?
        "#{Rails.application.routes.url_helpers.post_url(notifiable)}?expanded=true#comment_#{comment.id}"
      else
        Rails.application.routes.url_helpers.post_url(notifiable)
      end
    elsif notifiable.is_a?(Comment) || notifiable_type == 'Comment'
      return unless notifiable.commentable.present?

SELECT  `comments`.* FROM `comments`  WHERE `comments`.`id` IS NULL LIMIT 1
---
  def unscoped_comment
    Comment.unscoped.find_by_id(self.comment_id)