app/models/system_setting.rb

  def self.get name
    where(:name => name).first_or_initialize
---
SELECT  `system_settings`.* FROM `system_settings`  WHERE `system_settings`.`name` = 'enabled_questionnaire'  ORDER BY `system_settings`.`id` ASC LIMIT 1

  def self.get_values names
    values = {}
    where(:name => names).map do |setting|
---
SELECT `system_settings`.* FROM `system_settings`  WHERE `system_settings`.`name` IN ('page_title_home', 'page_title_template', 'page_title_sitename', 'page_title_separator')