app/models/treatment_summary.rb

	scope :for_treatment, lambda{ |treatment_name| joins(treatment_reviews: [:review]).where("lower(treatment_name) like ? or lower(posts.title) like ?", "%#{treatment_name.to_s.downcase}%", "%#{treatment_name.to_s.downcase}%") }
---
SELECT *, COUNT(id) as rcount, AVG(numeric_level) as average_level FROM (SELECT treatment_summaries.*, treatments.numeric_level FROM `treatment_summaries`
    	INNER JOIN `posts` ON `posts`.`id` = `treatment_summaries`.`latest_review_id` AND `posts`.`type` IN ('Review') AND `posts`.`deleted_at` IS NULL AND `posts`.`type` IN ('Review') AND (posts.deleted = false || posts.deleted is null)
    	INNER JOIN `treatments` ON `treatments`.`treatment_summary_id` = `treatment_summaries`.`id` AND (treatment <> '' and treatment is not null)
    	INNER JOIN `treatment_reviews` ON `treatment_reviews`.`treatment_id` = `treatments`.`id`
    	INNER JOIN `conditions_treatment_reviews` ON `conditions_treatment_reviews`.`treatment_review_id` = `treatment_reviews`.`id`
    	INNER JOIN `conditions` ON `conditions`.`id` = `conditions_treatment_reviews`.`condition_id`
    	INNER JOIN `conditions_treatment_summaries` `conditions_treatment_summaries_join` ON `conditions_treatment_summaries_join`.`treatment_summary_id` = `treatment_summaries`.`id`
    	INNER JOIN `conditions` `conditions_treatment_summaries` ON `conditions_treatment_summaries`.`id` = `conditions_treatment_summaries_join`.`condition_id`
    	WHERE
    		
    		(lower(treatments.treatment) LIKE '%%' or lower(treatment_name) like '%%') AND
    		(latest_review_id is not null) AND
    		treatments.numeric_level > 0
    	GROUP BY treatment_reviews.id ORDER BY posts.created_at desc) as t
  		GROUP BY id
  		
  		ORDER BY NULL

	def post_count_by_condition(user, condition = 'any')
		return self.treatments.joins(treatment_review: :review).where('posts.deleted is null').where('(treatment_reviews.content IS NOT NULL) OR (treatments.level IS NOT NULL)').count if condition == 'any'
---
SELECT COUNT(*) FROM `treatments` INNER JOIN `treatment_reviews` ON `treatment_reviews`.`treatment_id` = `treatments`.`id` INNER JOIN `posts` ON `posts`.`treatment_review_id` = `treatment_reviews`.`id` AND `posts`.`type` IN ('Review') AND `posts`.`deleted_at` IS NULL AND (posts.deleted = false OR posts.deleted is null) WHERE (treatment <> '' and treatment is not null) AND `treatments`.`treatment_summary_id` = 3410 AND (posts.deleted is null) AND ((treatment_reviews.content IS NOT NULL) OR (treatments.level IS NOT NULL))