app/models/user.rb

  scope :last_online, -> {order('last_sign_in_at DESC')}
  acts_as_taggable

  searchable do
    text :first_name, :last_name, :username, :email, :gender, :location, :city, :state, :bio
    text :username, as: :username_textp
    text :username_solr
    text :main_condition_name do
      main_condition.try(:name)
    end
    text :condition_names do
      user_conditions.map{|uc| uc.condition.name}
    end
    text :symptom_names do
      symptoms.map{|s| s.symptom}
    end
    text :treatment_names do
      treatments.map{|t| t.treatment}
---
SELECT `user_conditions`.* FROM `user_conditions`  WHERE `user_conditions`.`user_id` = 2
SELECT `treatments`.* FROM `treatments`  WHERE (treatment <> '' and treatment is not null) AND `treatments`.`user_id` = 2

  def self.find_first_by_auth_conditions(warden_conditions)
    conditions = warden_conditions.dup
    if login = conditions.delete(:login)
      where(conditions).where(["lower(username) = :value OR lower(email) = :value", { :value => login.downcase }]).first
---
SELECT  `users`.* FROM `users`  WHERE (lower(username) = 'joeytuan@gmail.com' OR lower(email) = 'joeytuan@gmail.com')  ORDER BY `users`.`id` ASC LIMIT 1

  def save_my_tags
    if skip_before_save
      self.skip_before_save = false
      return
    end

    tags_array = []

    tags_array << main_condition.try(:name) if main_condition.try(:name).present?

    self.symptoms.each do |symptom|
      tags_array << symptom.symptom unless tags_array.include?(symptom.symptom)
    end

    self.sub_categories.each do |sub_category|
      tags_array << sub_category.name
    end

    self.categories.each do |categories|
      tags_array << categories.name
    end

    self.conditions.each do |condition|
      tags_array << condition.name unless tags_array.include?(condition.name)
    end

    self.tag_list = tags_array.join(", ")
    self.skip_before_save = true
    self.save
---
SELECT `symptoms`.* FROM `symptoms`  WHERE (symptom <> '' and symptom is not null) AND `symptoms`.`user_id` = 2
SELECT `categories`.* FROM `categories` INNER JOIN `sub_categories` ON `categories`.`id` = `sub_categories`.`category_id` INNER JOIN `symptom_summaries` ON `sub_categories`.`id` = `symptom_summaries`.`sub_category_id` INNER JOIN `symptoms` ON `symptom_summaries`.`id` = `symptoms`.`symptom_summary_id` WHERE (symptom <> '' and symptom is not null) AND `symptoms`.`user_id` = 2
SELECT `conditions`.* FROM `conditions` INNER JOIN `user_conditions` ON `conditions`.`id` = `user_conditions`.`condition_id` WHERE `user_conditions`.`user_id` = 2  ORDER BY name asc
SELECT `tags`.* FROM `tags`  WHERE (LOWER(name) = LOWER('me/cfs') OR LOWER(name) = LOWER('gastrointestinal (gut) inflammation') OR LOWER(name) = LOWER('mold sensitivity') OR LOWER(name) = LOWER('chemical sensitivities') OR LOWER(name) = LOWER('unrefreshing or poor sleep quality') OR LOWER(name) = LOWER('brain fog') OR LOWER(name) = LOWER('post exertional malaise (pem/pene)') OR LOWER(name) = LOWER('fatigue') OR LOWER(name) = LOWER('orthostatic intolerance (pots/oi)') OR LOWER(name) = LOWER('temperature sensitivity to heat') OR LOWER(name) = LOWER('tachycardia') OR LOWER(name) = LOWER('sore throats') OR LOWER(name) = LOWER('muscle pain') OR LOWER(name) = LOWER('burning eyes') OR LOWER(name) = LOWER('mood disorder') OR LOWER(name) = LOWER('chronic inflammatory response syndrome') OR LOWER(name) = LOWER('irritable bowel syndrome') OR LOWER(name) = LOWER('lyme disease') OR LOWER(name) = LOWER('mcas') OR LOWER(name) = LOWER('multiple chemical sensitivities') OR LOWER(name) = LOWER('orthostatic intolerance / pots'))
UPDATE `users` SET `last_sign_in_at` = '2014-09-16 08:54:44', `current_sign_in_at` = '2015-05-25 07:22:45', `current_sign_in_ip` = '127.0.0.1', `sign_in_count` = 1488, `updated_at` = '2015-05-25 07:22:45' WHERE `users`.`id` = 2